#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

int main(void) {

	int x, y;

	int matA[100][100];
	int matB[100][100];

	int matC[100][100];

	printf("행 개수=");
	scanf("%d", &x);
	printf("열 개수=");
	scanf("%d", &y);

	printf("첫 번째 행렬 입력=\n");
	for (int i = 0; i < x; i++) {

		for (int j = 0; j < y; j++) {

			scanf("%d", &matA[i][j]);

		}

	}

	printf("두번째 행렬 입력=\n");
	for (int i = 0; i < x; i++) {

		for (int j = 0; j < y; j++) {

			scanf("%d", &matB[i][j]);

		}

	}

	//행렬곱 파악중....
	//c[0][0] = a[0][0] * b[0][0] + a[0][1] * b[1][0] + a[0][2] * b[2][0] -> 1 * 2 + 1 * 3 + 1 * 1 = 6

	//c[0][1] = a[0][0] * b[0][1] + a[0][1] * b[1][1] + a[0][2] * b[2][1] -> 1 * 2 + 1 * 3 + 1 * 1 = 6 

	//c[0][2] = a[0][0] * b[0][2] + a[0][1] * b[1][2] + a[0][2] * b[2][2] -> 1 * 2 + 1 * 3 + 1 * 1 = 6 

	//c[1][0] = a[1][0] * b[0][0] + a[1][1] * b[1][0] + a[1][2] * b[2][0] -> 2 * 2 + 2 * 3 + 2 * 1 = 12

	//c[1][1] = a[1][0] * b[0][1] + a[1][1] * b[1][1] + a[1][2] * b[2][1] -> 2 * 2 + 2 * 3 + 2 * 1 = 12

	//c[1][2] = a[1][0] * b[0][2] + a[1][1] * b[1][2] + a[1][2] * b[2][2] -> 2 * 2 + 2 * 3 + 2 * 1 = 12

	//c[2][0] = a[2][0] * b[0][0] + a[2][1] * b[1][0] + a[2][2] * b[2][0] -> 3 * 2 + 3 * 3 + 3 * 1 = 18

	//c[2][1] = a[2][0] * b[0][1] + a[2][1] * b[1][1] + a[2][2] * b[2][1] -> 3 * 2 + 3 * 3 + 3 * 1 = 18

	//c[2][2] = a[2][0] * b[0][2] + a[2][1] * b[1][2] + a[2][2] * b[2][2] -> 3 * 2 + 3 * 3 + 3 * 1 = 18

	for (int i = 0; i < x; i++) {

		for (int j = 0; j < y; j++) {

			matC[i][j] = 0;

			for (int k = 0; k < x; k++) {

				matC[i][j] += matA[i][k] * matB[k][j];


			}
		}
	}

	for (int i = 0; i < x; i++) {

		for (int j = 0; j < y; j++) {

			printf("%d ", matC[i][j]);

		}

		printf("\n");

	}

	return 0;

}